#### Terraform Format and Style :`success`
#### Terraform Initialization :`success`
#### Terraform Validation :
```
undefined
```
#### Terraform Plan :
<details><summary>Show Plan</summary>
```
Acquiring state lock. This may take a few moments...
random_integer.name_suffix: Refreshing state... [id=23377]
azurerm_resource_group.app_service: Refreshing state... [id=/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/adolabs-23377]
azurerm_app_service_plan.app_service: Refreshing state... [id=/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/adolabs-23377/providers/Microsoft.Web/serverFarms/adolabs-23377]
azurerm_app_service.app_service: Refreshing state... [id=/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/adolabs-23377/providers/Microsoft.Web/sites/adolabs-23377]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_app_service.app_service will be destroyed
  # (because azurerm_app_service.app_service is not in configuration)
  - resource "azurerm_app_service" "app_service" {
      - app_service_plan_id               = "/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/adolabs-23377/providers/Microsoft.Web/serverFarms/adolabs-23377" -> null
      - app_settings                      = {
          - "WEBSITE_NODE_DEFAULT_VERSION" = "6.9.1"
        } -> null
      - client_affinity_enabled           = false -> null
      - client_cert_enabled               = false -> null
      - client_cert_mode                  = "Required" -> null
      - custom_domain_verification_id     = "0FB226D988075D0657EF6571ABE2695579933A36B261D7BF23A938E9F0C98D74" -> null
      - default_site_hostname             = "adolabs-23377.azurewebsites.net" -> null
      - enabled                           = true -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/adolabs-23377/providers/Microsoft.Web/sites/adolabs-23377" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - location                          = "eastus" -> null
      - name                              = "adolabs-23377" -> null
      - outbound_ip_address_list          = [
          - "52.151.232.87",
          - "52.151.232.195",
          - "52.151.233.231",
          - "52.151.239.6",
          - "52.188.138.231",
          - "52.188.139.192",
          - "20.119.0.5",
        ] -> null
      - outbound_ip_addresses             = "52.151.232.87,52.151.232.195,52.151.233.231,52.151.239.6,52.188.138.231,52.188.139.192,20.119.0.5" -> null
      - possible_outbound_ip_address_list = [
          - "52.151.232.87",
          - "52.151.232.195",
          - "52.151.233.231",
          - "52.151.239.6",
          - "52.188.138.231",
          - "52.188.139.192",
          - "51.8.248.137",
          - "52.188.141.34",
          - "52.188.142.78",
          - "40.71.232.1",
          - "40.71.232.51",
          - "40.71.232.223",
          - "40.71.233.112",
          - "40.71.234.112",
          - "40.71.234.232",
          - "40.71.235.166",
          - "40.71.235.171",
          - "40.71.235.251",
          - "40.71.236.145",
          - "52.142.32.248",
          - "52.142.33.10",
          - "52.142.35.99",
          - "52.142.35.107",
          - "52.142.35.115",
          - "52.142.36.46",
          - "52.142.36.141",
          - "52.142.38.119",
          - "52.142.39.82",
          - "52.149.168.243",
          - "52.149.169.230",
          - "52.149.170.64",
          - "20.119.0.5",
        ] -> null
      - possible_outbound_ip_addresses    = "52.151.232.87,52.151.232.195,52.151.233.231,52.151.239.6,52.188.138.231,52.188.139.192,51.8.248.137,52.188.141.34,52.188.142.78,40.71.232.1,40.71.232.51,40.71.232.223,40.71.233.112,40.71.234.112,40.71.234.232,40.71.235.166,40.71.235.171,40.71.235.251,40.71.236.145,52.142.32.248,52.142.33.10,52.142.35.99,52.142.35.107,52.142.35.115,52.142.36.46,52.142.36.141,52.142.38.119,52.142.39.82,52.149.168.243,52.149.169.230,52.149.170.64,20.119.0.5" -> null
      - resource_group_name               = "adolabs-23377" -> null
      - site_credential                   = [
          - {
              - password = "FkBb8dj4ARYKPmjql45R6riebn2bh9cxEY6FHu4ix8fgm0Q7ve0Y1gtw0gtX"
              - username = "$adolabs-23377"
            },
        ] -> null
      - tags                              = {} -> null

      - auth_settings {
          - additional_login_params        = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - enabled                        = false -> null
          - token_refresh_extension_hours  = 0 -> null
          - token_store_enabled            = false -> null
            # (4 unchanged attributes hidden)
        }

      - logs {
          - detailed_error_messages_enabled = false -> null
          - failed_request_tracing_enabled  = false -> null

          - application_logs {
              - file_system_level = "Off" -> null
            }

          - http_logs {
            }
        }

      - site_config {
          - acr_use_managed_identity_credentials = false -> null
          - always_on                            = false -> null
          - default_documents                    = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> null
          - dotnet_framework_version             = "v4.0" -> null
          - ftps_state                           = "FtpsOnly" -> null
          - http2_enabled                        = false -> null
          - ip_restriction                       = [] -> null
          - local_mysql_enabled                  = false -> null
          - managed_pipeline_mode                = "Integrated" -> null
          - min_tls_version                      = "1.2" -> null
          - number_of_workers                    = 1 -> null
          - php_version                          = "5.6" -> null
          - remote_debugging_enabled             = false -> null
          - scm_ip_restriction                   = [] -> null
          - scm_type                             = "ExternalGit" -> null
          - scm_use_main_ip_restriction          = false -> null
          - use_32_bit_worker_process            = true -> null
          - vnet_route_all_enabled               = false -> null
          - websockets_enabled                   = false -> null
            # (11 unchanged attributes hidden)
        }

      - source_control {
          - branch             = "main" -> null
          - manual_integration = true -> null
          - repo_url           = "https://github.com/ned1313/nodejs-docs-hello-world" -> null
          - rollback_enabled   = false -> null
          - use_mercurial      = false -> null
        }
    }

  # azurerm_app_service_plan.app_service will be destroyed
  # (because azurerm_app_service_plan.app_service is not in configuration)
  - resource "azurerm_app_service_plan" "app_service" {
      - id                           = "/subscriptions/d5453260-ba13-475a-b686-0104a9566180/resourceGroups/adolabs-23377/providers/Microsoft.Web/serverFarms/adolabs-23377" -> null
      - is_xenon                     = false -> null
      - kind                         = "Windows" -> null
      - location                     = "eastus" -> null
      - maximum_elastic_worker_count = 1 -> null
      - maximum_number_of_workers    = 10 -> null
      - name                         = "adolabs-23377" -> null
      - per_site_scaling             = false -> null
      - reserved                     = false -> null
      - resource_group_name          = "adolabs-23377" -> null
      - tags                         = {} -> null
      - zone_redundant               = false -> null
        # (1 unchanged attribute hidden)

      - sku {
          - capacity = 1 -> null
          - size     = "S1" -> null
          - tier     = "Standard" -> null
        }
    }

  # azurerm_app_service_source_control.app_source_control will be created
  + resource "azurerm_app_service_source_control" "app_source_control" {
      + app_id                 = (known after apply)
      + branch                 = "main"
      + id                     = (known after apply)
      + repo_url               = "https://github.com/ned1313/nodejs-docs-hello-world"
      + rollback_enabled       = false
      + scm_type               = (known after apply)
      + use_local_git          = false
      + use_manual_integration = true
      + use_mercurial          = false
      + uses_github_action     = (known after apply)
    }

  # azurerm_service_plan.app_service will be created
  + resource "azurerm_service_plan" "app_service" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "eastus"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "adolabs-23377"
      + os_type                         = "Windows"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "adolabs-23377"
      + sku_name                        = "S1"
      + worker_count                    = (known after apply)
    }

  # azurerm_windows_web_app.app_service will be created
  + resource "azurerm_windows_web_app" "app_service" {
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "adolabs-23377"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "adolabs-23377"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + virtual_network_backup_restore_enabled         = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + windows_fx_version                      = (known after apply)
          + worker_count                            = (known after apply)

          + application_stack (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```          
</details>

*Pusher: @raradhye, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*